[
  {
    "title": "Backend Developer",
    "description": "Design and develop server-side logic and APIs for web applications. Work closely with frontend developers to integrate user-facing elements. Ensure high performance and responsiveness of backend systems. Collaborate with team members to design and launch new features and enhancements.",
    "responsibilities": "Develop backend components using Python and Django framework. Write reusable, testable, and efficient code. Integrate data storage solutions, such as PostgreSQL. Implement security and data protection measures. Optimize applications for maximum speed and scalability.",
    "whoYouAre": "Experienced in backend development with a strong understanding of web technologies. Proficient in Python, Django, and RESTful APIs. Familiar with Agile methodologies and version control tools (e.g., Git). Ability to work independently and in a team environment.",
    "otherSkills": "Knowledge of AWS services (e.g., EC2, S3) and Docker. Understanding of asynchronous programming and task queues (e.g., Celery). Experience with frontend technologies like JavaScript, HTML, and CSS is a plus.",
    "salary": 100000.0,
    "type": "FullTime",
    "applyBefore": "2024-11-15T23:59:59Z",
    "companyId": "clybmw6ca000dfsnlqikybrg0",
    "categoryId": "clybn52bs000d9rjang8lq2k4"
  },
  {
    "title": "Data Scientist",
    "description": "Apply statistical analysis and machine learning techniques to extract insights from large datasets. Develop predictive models and algorithms to address business challenges. Collaborate with cross-functional teams to identify opportunities for data-driven decision-making and product enhancements.",
    "responsibilities": "Cleanse, transform, and analyze data using statistical methods and tools like Python and R. Build and deploy machine learning models. Interpret and communicate findings to non-technical stakeholders. Continuously learn and apply new methodologies in data science and analytics.",
    "whoYouAre": "Advanced degree in statistics, mathematics, computer science, or related field. Proven experience as a data scientist or analyst. Strong analytical and problem-solving skills. Ability to work effectively in a fast-paced and dynamic environment.",
    "otherSkills": "Proficiency in Python, R, SQL, and data visualization tools (e.g., Tableau, Power BI). Familiarity with big data technologies (e.g., Hadoop, Spark) is a plus. Experience with cloud platforms (e.g., AWS, Azure) and deep learning frameworks (e.g., TensorFlow, PyTorch) is desirable.",
    "salary": 120000.0,
    "type": "FullTime",
    "applyBefore": "2024-11-20T23:59:59Z",
    "companyId": "clybmw6ca000efsnlsj9m6knk",
    "categoryId": "clybn52bs000e9rja1b8zhj1v"
  },
  {
    "title": "DevOps Engineer",
    "description": "Design, implement, and maintain continuous integration and delivery pipelines. Automate and streamline operations and processes. Monitor and optimize system performance and reliability. Collaborate with development teams to ensure efficient deployment and operation of systems.",
    "responsibilities": "Build and maintain tools for deployment, monitoring, and operations. Troubleshoot and resolve issues in development, test, and production environments. Ensure scalability and security of infrastructure components. Implement best practices for infrastructure as code.",
    "whoYouAre": "Solid background in Linux/Unix administration. Experience with cloud platforms (e.g., AWS, Azure, GCP) and containerization tools (e.g., Docker, Kubernetes). Proficiency in scripting languages (e.g., Shell, Python, Ruby). Strong problem-solving and communication skills.",
    "otherSkills": "Knowledge of CI/CD pipelines and version control systems (e.g., Git). Familiarity with configuration management tools (e.g., Ansible, Chef, Puppet). Understanding of network protocols and security practices. Certification in cloud technologies (e.g., AWS Certified DevOps Engineer) is a plus.",
    "salary": 110000.0,
    "type": "FullTime",
    "applyBefore": "2024-11-25T23:59:59Z",
    "companyId": "clybmw6ca000ffsnlupg512zj",
    "categoryId": "clybn52bs000f9rja1813zdrh"
  },
  {
    "title": "Machine Learning Engineer",
    "description": "Design and develop machine learning models and algorithms. Implement data pipelines and workflows for training and deploying models. Collaborate with data scientists and software engineers to integrate machine learning solutions into products and systems.",
    "responsibilities": "Research, experiment, and implement cutting-edge machine learning techniques. Optimize and fine-tune models for performance and scalability. Evaluate and validate models to ensure accuracy and reliability. Communicate findings and insights to technical and non-technical stakeholders.",
    "whoYouAre": "Advanced degree in computer science, engineering, or a related field. Proven experience in machine learning and deep learning projects. Proficiency in programming languages like Python and libraries such as TensorFlow or PyTorch. Strong mathematical and statistical background.",
    "otherSkills": "Experience with big data platforms and tools (e.g., Spark, Hadoop). Familiarity with cloud platforms and services (e.g., AWS, Azure). Knowledge of natural language processing (NLP) and computer vision (CV) is advantageous.",
    "salary": 130000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-01T23:59:59Z",
    "companyId": "clybmw6ca000gfsnlwrxwza8l",
    "categoryId": "clybn52bs000g9rjax5jh6lme"
  },
  {
    "title": "Cybersecurity Analyst",
    "description": "Monitor and protect the organization's networks and systems from cyber threats. Conduct security assessments and audits to identify vulnerabilities and recommend security enhancements. Respond to incidents and breaches to minimize impact and ensure compliance with security policies.",
    "responsibilities": "Deploy and manage security systems and tools (e.g., firewalls, SIEM). Analyze security incidents and conduct forensic investigations. Develop and implement security policies and procedures. Educate staff on security best practices and ensure adherence to security standards.",
    "whoYouAre": "Solid understanding of cybersecurity principles and best practices. Experience with security technologies and tools. Strong analytical and problem-solving skills. Ability to work under pressure and respond effectively to security incidents.",
    "otherSkills": "Knowledge of regulatory requirements and frameworks (e.g., GDPR, NIST). Certification in cybersecurity (e.g., CISSP, CISM) is preferred. Familiarity with penetration testing and ethical hacking techniques.",
    "salary": 105000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-05T23:59:59Z",
    "companyId": "clybmw6ca000hfsnlbcgwmfuv",
    "categoryId": "clybn52bs000h9rjafemwh5i8"
  },
  {
    "title": "Product Manager",
    "description": "Lead the product development lifecycle from ideation to launch. Define product vision, strategy, and roadmap based on market research and customer feedback. Collaborate with cross-functional teams to prioritize features and enhancements.",
    "responsibilities": "Gather and analyze user feedback and data to inform product decisions. Define and prioritize product features and requirements. Work closely with engineering, design, and marketing teams to deliver successful product releases.",
    "whoYouAre": "Proven experience as a product manager or similar role. Strong analytical and problem-solving skills. Excellent communication and leadership abilities. Ability to translate complex technical concepts into clear business terms.",
    "otherSkills": "Knowledge of Agile methodologies and product management tools. Experience in SaaS or software product development is desirable. Understanding of UI/UX principles and market trends.",
    "salary": 115000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-10T23:59:59Z",
    "companyId": "clybmw6ca000ifsnlw0vj4uyl",
    "categoryId": "clybn52bs000i9rjaa8pwbllm"
  },
  {
    "title": "UX/UI Designer",
    "description": "Create intuitive and visually appealing user interfaces for web and mobile applications. Conduct user research, usability testing, and analysis to optimize user experience. Collaborate with product managers and developers to translate concepts into wireframes and prototypes.",
    "responsibilities": "Design and prototype user interfaces and interactions. Ensure consistency and usability across platforms. Iterate on designs based on user feedback and usability testing results. Work closely with development teams to implement designs and ensure pixel-perfect execution.",
    "whoYouAre": "Proven experience as a UX/UI designer or similar role. Proficiency in design and prototyping tools (e.g., Sketch, Adobe XD, Figma). Strong portfolio demonstrating design expertise and problem-solving skills. Understanding of front-end development technologies and frameworks.",
    "otherSkills": "Knowledge of design systems and responsive design principles. Experience with motion design and animation is a plus. Ability to work effectively in a collaborative environment and communicate design decisions.",
    "salary": 95000.0,
    "type": "FullTime",
    "applyBefore": "2024-11-30T23:59:59Z",
    "companyId": "clybmw6ca000jfsnlqlzi8ltl",
    "categoryId": "clybn52bs000j9rjan2y238e5"
  },
  {
    "title": "Software Engineer",
    "description": "Design, develop, and maintain scalable software solutions. Collaborate with product managers and designers to understand requirements and translate them into technical solutions. Write clean, efficient, and testable code.",
    "responsibilities": "Develop backend services and APIs using programming languages like Java, Python, or Node.js. Implement front-end interfaces using HTML, CSS, and JavaScript frameworks. Perform code reviews and ensure code quality and scalability.",
    "whoYouAre": "Solid understanding of software engineering principles and best practices. Experience in full-stack development and familiarity with cloud platforms (e.g., AWS, Azure). Strong problem-solving and analytical skills.",
    "otherSkills": "Knowledge of relational and non-relational databases (e.g., PostgreSQL, MongoDB). Familiarity with version control systems (e.g., Git). Experience with Agile methodologies and continuous integration/continuous deployment (CI/CD) pipelines.",
    "salary": 105000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-02T23:59:59Z",
    "companyId": "clybmw6ca0000fsnlqrf7ovn1",
    "categoryId": "clybn52bs00009rjafhni4rqi"
  },
  {
    "title": "Cloud Solutions Architect",
    "description": "Design and implement scalable cloud solutions based on business requirements. Define cloud architecture best practices and standards. Assess existing applications and infrastructure to recommend cloud migration and optimization strategies.",
    "responsibilities": "Develop architectural solutions for cloud-based platforms (e.g., AWS, Azure, Google Cloud). Collaborate with development teams to ensure applications are cloud-ready. Provide guidance and support during implementation and deployment phases.",
    "whoYouAre": "Proven experience as a cloud architect or similar role. Deep understanding of cloud computing technologies and services. Strong knowledge of infrastructure as code and configuration management tools.",
    "otherSkills": "Certification in cloud platforms (e.g., AWS Certified Solutions Architect). Experience with containerization and orchestration tools (e.g., Docker, Kubernetes). Familiarity with DevOps practices and CI/CD pipelines.",
    "salary": 125000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-03T23:59:59Z",
    "companyId": "clybmw6ca0001fsnlitbbsu0m",
    "categoryId": "clybn52bs00019rjawnggi97h"
  },
  {
    "title": "Backend Software Engineer",
    "description": "Develop and maintain server-side applications and APIs. Implement scalable and high-performance backend services. Collaborate with frontend developers to integrate user-facing elements with server-side logic.",
    "responsibilities": "Write clean, efficient, and maintainable code in languages like Python, Java, or Node.js. Design and optimize database schemas and queries. Implement security and data protection measures. Ensure responsiveness and reliability of backend applications.",
    "whoYouAre": "Solid experience in backend development with proficiency in programming languages and frameworks. Familiarity with relational and non-relational databases. Strong problem-solving skills and ability to troubleshoot complex issues.",
    "otherSkills": "Knowledge of cloud platforms (e.g., AWS, Azure) and containerization technologies (e.g., Docker). Experience with RESTful APIs and microservices architecture. Understanding of Agile methodologies and CI/CD pipelines.",
    "salary": 110000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-04T23:59:59Z",
    "companyId": "clybmw6ca0002fsnlnouavn3e",
    "categoryId": "clybn52bs00029rjaf96hwtej"
  },
  {
    "title": "Frontend Developer",
    "description": "Create responsive and intuitive user interfaces for web applications. Collaborate with designers and backend developers to implement features and optimize performance. Ensure compatibility across browsers and devices.",
    "responsibilities": "Develop frontend components using HTML, CSS, and JavaScript frameworks (e.g., React, Angular). Collaborate with UX/UI designers to iterate on designs and prototypes. Optimize applications for maximum speed and scalability.",
    "whoYouAre": "Proven experience as a frontend developer or similar role. Proficiency in frontend technologies and frameworks. Strong problem-solving skills and attention to detail. Ability to work independently and in a team environment.",
    "otherSkills": "Knowledge of cross-browser compatibility issues and ways to work around them. Familiarity with RESTful APIs and state management libraries (e.g., Redux). Experience with responsive design and mobile-first development.",
    "salary": 100000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-05T23:59:59Z",
    "companyId": "clybmw6ca0003fsnlqwklv73r",
    "categoryId": "clybn52bs00039rjayjscf7lz"
  },
  {
    "title": "Mobile App Developer",
    "description": "Design and develop native and cross-platform mobile applications. Collaborate with product managers and designers to define app features and user interfaces. Ensure mobile applications are optimized for performance and usability.",
    "responsibilities": "Develop mobile applications for iOS and Android platforms using languages like Swift, Kotlin, or React Native. Integrate with backend services and APIs. Troubleshoot and debug applications to optimize performance and usability.",
    "whoYouAre": "Proven experience in mobile app development with a strong portfolio of apps published on app stores. Proficiency in mobile programming languages and frameworks. Familiarity with mobile UI design guidelines and best practices.",
    "otherSkills": "Knowledge of RESTful APIs and mobile security best practices. Experience with version control systems (e.g., Git). Understanding of Agile methodologies and continuous integration practices.",
    "salary": 95000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-06T23:59:59Z",
    "companyId": "clybmw6ca0004fsnlp9if32ox",
    "categoryId": "clybn52bs00049rja5tro69vw"
  },
  {
    "title": "Data Engineer",
    "description": "Design and implement data pipelines and ETL processes. Develop and maintain data warehouses and databases. Collaborate with data scientists and analysts to support data-driven decision-making.",
    "responsibilities": "Design, build, and maintain scalable data pipelines and infrastructure. Develop data models and schemas to support analytics and reporting. Optimize and tune database performance and ETL processes.",
    "whoYouAre": "Solid experience as a data engineer or similar role. Proficiency in database technologies and data modeling. Strong understanding of ETL processes and data integration techniques.",
    "otherSkills": "Experience with big data platforms (e.g., Hadoop, Spark) and cloud-based data services (e.g., AWS Redshift, Google BigQuery). Knowledge of programming languages (e.g., Python, SQL) and scripting skills.",
    "salary": 105000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-07T23:59:59Z",
    "companyId": "clybmw6ca0005fsnlnk8zl4z3",
    "categoryId": "clybn52bs00059rja5dxkbhhl"
  },
  {
    "title": "Full Stack Developer",
    "description": "Develop and maintain full-stack web applications. Collaborate with product managers and designers to define features and user interfaces. Write clean, efficient, and scalable code for both frontend and backend components.",
    "responsibilities": "Design and implement APIs and services using backend languages and frameworks (e.g., Node.js, Django). Develop responsive and intuitive user interfaces using frontend technologies (e.g., React, Vue.js).",
    "whoYouAre": "Proven experience as a full-stack developer or similar role. Proficiency in both frontend and backend technologies. Strong problem-solving and analytical skills. Ability to work effectively in a fast-paced environment.",
    "otherSkills": "Knowledge of database technologies (e.g., MySQL, MongoDB) and ORM frameworks. Familiarity with cloud platforms and services (e.g., AWS, Azure). Experience with Agile methodologies and CI/CD pipelines.",
    "salary": 110000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-08T23:59:59Z",
    "companyId": "clybmw6ca0006fsnlwikijvno",
    "categoryId": "clybn52bs00069rja4wlr1etg"
  },
  {
    "title": "Network Engineer",
    "description": "Design, implement, and maintain network infrastructure and services. Troubleshoot network issues and optimize performance. Collaborate with IT teams to ensure secure and reliable network connectivity.",
    "responsibilities": "Configure and manage network devices (e.g., routers, switches). Monitor network performance and implement improvements as needed. Support and troubleshoot LAN/WAN connectivity, routers, firewalls, and security.",
    "whoYouAre": "Solid understanding of networking protocols and technologies. Experience with network design and implementation. Strong problem-solving and analytical skills. Ability to work independently and as part of a team.",
    "otherSkills": "Knowledge of security best practices and network troubleshooting tools. Familiarity with network monitoring and management tools (e.g., Wireshark, Nagios). Certification in networking (e.g., CCNA, CCNP) is a plus.",
    "salary": 100000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-09T23:59:59Z",
    "companyId": "clybmw6ca0007fsnl1wpaap1l",
    "categoryId": "clybn52bs00079rjagto55kyv"
  },
  {
    "title": "QA Engineer",
    "description": "Develop and execute test plans and test cases for software applications. Identify and document software defects and issues. Collaborate with development teams to ensure high-quality releases.",
    "responsibilities": "Design and implement automated testing frameworks and tools. Conduct functional, regression, and performance testing. Analyze test results and provide feedback to improve software quality and reliability.",
    "whoYouAre": "Proven experience as a QA engineer or similar role. Strong knowledge of software QA methodologies, tools, and processes. Excellent problem-solving and debugging skills. Detail-oriented with a passion for quality.",
    "otherSkills": "Experience with test automation tools (e.g., Selenium, Appium). Knowledge of scripting languages (e.g., Python, JavaScript) for automation. Familiarity with Agile methodologies and continuous integration practices.",
    "salary": 95000.0,
    "type": "FullTime",
    "applyBefore": "2024-12-10T23:59:59Z",
    "companyId": "clybmw6ca0008fsnla3lfhs0g",
    "categoryId": "clybn52bs00089rjaqbztaiy0"
  }
]
